neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_unicommspi.h
__STATIC_INLINE bool DL_SPI_isRXFIFOCleared(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->spi->STAT & UNICOMMSPI_STAT_RXCLR_MASK) ==
            UNICOMMSPI_STAT_RXCLR_SET);
}

/**
 *  @brief      returns current cdmode value
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     returns current cdmode value
 */
__STATIC_INLINE uint32_t DL_SPI_getCurrentCDMODEValue(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->spi->STAT & UNICOMMSPI_STAT_CDMODE_MASK) >>
            UNICOMMSPI_STAT_CDMODE_OFS);
}

/**
 *  @brief      Sets the parity configuration used for transactions
 *
 *  This API sets the configuration for both receive parity and transmit parity.
 *  This includes which bit is used, and whether even or odd parity is set.
 *
 *  To individually enable or dsiable the receive or transmit parity, refer to
 *  the APIs listed below.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  parity  Parity configuration to use. One of @ref DL_SPI_PARITY.
 *
 *  @sa         DL_SPI_init
 *  @sa         DL_SPI_enableReceiveParity
 *  @sa         DL_SPI_disableReceiveParity
 *  @sa         DL_SPI_enableTransmitParity
 *  @sa         DL_SPI_disableTransmitParity
 */
__STATIC_INLINE void DL_SPI_setParity(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_PARITY parity)
{
    DL_Common_updateReg(&unicomm->spi->CTL1, (uint32_t) parity,
        (UNICOMMSPI_CTL1_PREN_MASK | UNICOMMSPI_CTL1_PTEN_MASK |
            UNICOMMSPI_CTL1_PES_MASK));
}

/**
 *  @brief      Get the current receive and transmit parity configuration
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The current parity configuration being used
 *
 *  @retval     One of @ref DL_SPI_PARITY
 */
__STATIC_INLINE DL_SPI_PARITY DL_SPI_getParity(UNICOMM_Inst_Regs *unicomm)
{
    uint32_t parity = unicomm->spi->CTL1 &
                      (UNICOMMSPI_CTL1_PES_MASK | UNICOMMSPI_CTL1_PREN_MASK |
                          UNICOMMSPI_CTL1_PTEN_MASK);

    return (DL_SPI_PARITY)(parity);
}

/**
 *  @brief      Enables receive parity
 *
 *  This API only enables receive parity, it does not configure the parity mode
 *  used.
 *
 *  @param[in]  unicomm  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_SPI_setParity
 */
__STATIC_INLINE void DL_SPI_enableReceiveParity(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_PREN_ENABLE;
}

/**
 *  @brief      Disables receive parity
 *
 *  This API only disable receive parity, it does not configure the parity mode
 *  used.
 *
 *  @param[in]  unicomm  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_SPI_setParity
 */
__STATIC_INLINE void DL_SPI_disableReceiveParity(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_PREN_MASK);
}

/**
 *  @brief      Checks if receive parity is enabled
 *
 *  @param[in]  unicomm  pointer to the register overlay for the peripheral
 *
 *  @return     If receive parity is enabled
 *
 *  @retval     true   Receive parity is enabled
 *  @retval     false  Receive parity is disabled
 */
__STATIC_INLINE bool DL_SPI_isReceiveParityEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_PREN_MASK) ==
            UNICOMMSPI_CTL1_PREN_ENABLE);
}

/**
 *  @brief      Enables transmit parity
 *
 *  This API only enables transmit parity, it does not configure the parity mode
 *  used.
 *
 *  @param[in]  unicomm  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_SPI_setParity
 */
__STATIC_INLINE void DL_SPI_enableTransmitParity(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_PTEN_ENABLE;
}

/**
 *  @brief      Disables transmit parity
 *
 *  This API only disables transmit parity, it does not configure the parity
 *  mode used.
 *
 *  @param[in]  unicomm  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_SPI_setParity
 */
__STATIC_INLINE void DL_SPI_disableTransmitParity(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_PTEN_MASK);
}

/**
 *  @brief      Checks if transmit parity is enabled
 *
 *  @param[in]  unicomm  pointer to the register overlay for the peripheral
 *
 *  @return     If transmit parity is enabled
 *
 *  @retval     true   Transmit parity is enabled
 *  @retval     false  Transmit parity is disabled
 */
__STATIC_INLINE bool DL_SPI_isTransmitParityEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_PTEN_MASK) ==
            UNICOMMSPI_CTL1_PTEN_ENABLE);
}

/**
 *  @brief      Set the frame format to use
 *
 *  Configures the frame format to use for transactions. If you are using chip
 *  select you must use one of the Motorola 4 wire frame formats.
 *
 *  @param[in]  unicomm          Pointer to the register overlay for the peripheral
 *  @param[in]  frameFormat  Frame format to use. One of @ref
 *                           DL_SPI_FRAME_FORMAT.
 *
 *  @sa         DL_SPI_init
 */
__STATIC_INLINE void DL_SPI_setFrameFormat(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_FRAME_FORMAT frameFormat)
{
    DL_Common_updateReg(&unicomm->spi->CTL0, (uint32_t) frameFormat,
        (UNICOMMSPI_CTL0_FRF_MASK | UNICOMMSPI_CTL0_SPO_MASK |
            UNICOMMSPI_CTL0_SPH_MASK));
}

/**
 *  @brief      Get the frame format configuration
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The current frame format being used
 *
 *  @retval     One of @ref DL_SPI_FRAME_FORMAT
 */
__STATIC_INLINE DL_SPI_FRAME_FORMAT DL_SPI_getFrameFormat(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t frameFormat = unicomm->spi->CTL0 & (UNICOMMSPI_CTL0_FRF_MASK |
                                                    UNICOMMSPI_CTL0_SPO_MASK |
                                                    UNICOMMSPI_CTL0_SPH_MASK);

    return (DL_SPI_FRAME_FORMAT)(frameFormat);
}

/**
 *  @brief      Set the size for transfers
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the peripheral
 *  @param[in]  dataSize  Number of bits used in a transfer.
 *                        One of @ref DL_SPI_DATA_SIZE
 *
 *  @sa         DL_SPI_init
 */
__STATIC_INLINE void DL_SPI_setDataSize(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_DATA_SIZE dataSize)
{
    DL_Common_updateReg(
        &unicomm->spi->CTL0, (uint32_t) dataSize, UNICOMMSPI_CTL0_DSS_MASK);
}

/**
 *  @brief      Get the configured size for transfers
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The currently configured size for transfers
 *
 *  @retval     One of @ref DL_SPI_DATA_SIZE
 */
__STATIC_INLINE DL_SPI_DATA_SIZE DL_SPI_getDataSize(UNICOMM_Inst_Regs *unicomm)
{
    uint32_t dataSize = unicomm->spi->CTL0 & UNICOMMSPI_CTL0_DSS_MASK;

    return (DL_SPI_DATA_SIZE)(dataSize);
}

/**
 *  @brief      Set whether the device should be in controller/peripheral mode
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *  @param[in]  mode  Mode to configure the SPI into. One of @ref DL_SPI_MODE.
 *
 *  @sa         DL_SPI_init
 */
__STATIC_INLINE void DL_SPI_setMode(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_MODE mode)
{
    DL_Common_updateReg(
        &unicomm->spi->CTL1, (uint32_t) mode, UNICOMMSPI_CTL1_CP_MASK);
}

/**
 *  @brief      Get the current mode for the SPI (controller/peripheral)
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The currently configured mode for the SPI (controller/peripheral)
 *
 *  @retval     One of @ref DL_SPI_MODE.
 */
__STATIC_INLINE DL_SPI_MODE DL_SPI_getMode(UNICOMM_Inst_Regs *unicomm)
{
    uint32_t mode = unicomm->spi->CTL1 & UNICOMMSPI_CTL1_CP_MASK;

